In [1]:
import pandas as pd 
import sqlite3

# Ejercicio

   * i) cuántos equipos diferentes hay?

   * ii) cuantos jugadores con nombre Michael cumplen años en 1992?

In [2]:
database = 'database.sqlite'
conn = sqlite3.connect(database)

#Averiguamos los datos que se tienen (tablas)
tables = pd.read_sql(""" SELECT *
                    FROM sqlite_master
                    WHERE type= 'table';""", conn)

In [9]:
a = pd.read_sql("""SELECT * 
                FROM Team;""",conn)
a

        id  team_api_id  team_fifa_api_id      team_long_name team_short_name
0        1         9987             673.0            KRC Genk             GEN
1        2         9993             675.0        Beerschot AC             BAC
2        3        10000           15005.0    SV Zulte-Waregem             ZUL
3        4         9994            2007.0    Sporting Lokeren             LOK
4        5         9984            1750.0   KSV Cercle Brugge             CEB
..     ...          ...               ...                 ...             ...
294  49479        10190             898.0       FC St. Gallen             GAL
295  49837        10191            1715.0             FC Thun             THU
296  50201         9777             324.0         Servette FC             SER
297  50204         7730            1862.0  FC Lausanne-Sports             LAU
298  51606         7896               NaN              Lugano             LUG

[299 rows x 5 columns]

In [14]:
pd.read_sql(""" SELECT COUNT(DISTINCT (team_long_name))
                FROM Team;""", conn)

   COUNT(DISTINCT (team_long_name))
0                               296

In [ ]:
pd.read_sql(""" SELECT COUNT(DISTINCT (team_long_name))
                FROM Team;""", conn)